	.section .text
.LNDBG_TX:
# mark_description "Intel(R) C++ Intel(R) 64 Compiler for applications running on Intel(R) 64, Version 18.0.3.222 Build 20180410";
# mark_description "";
# mark_description "-S -O3 -fopenmp -march=native -g";
	.file "parallel_2.c"
	.text
..TXTST0:
.L_2__routine_start_main_0:
# -- Begin  main, L_main_18__par_loop0_2.0
	.text
# mark_begin;
       .align    16,0x90
	.globl main
# --- main()
main:
..B1.1:                         # Preds ..B1.0
                                # Execution count [0.00e+00]
	.cfi_startproc
	.cfi_personality 0x3,__gxx_personality_v0
..___tag_value_main.2:
..L3:
                                                          #41.12
..LN0:
	.file   1 "sources/parallel_2.c"
	.loc    1  41  is_stmt 1
        pushq     %rbp                                          #41.12
	.cfi_def_cfa_offset 16
..LN1:
        movq      %rsp, %rbp                                    #41.12
	.cfi_def_cfa 6, 16
	.cfi_offset 6, -16
..LN2:
        andq      $-128, %rsp                                   #41.12
..LN3:
        subq      $512, %rsp                                    #41.12
..LN4:
        xorl      %esi, %esi                                    #41.12
..LN5:
        movl      $3, %edi                                      #41.12
..LN6:
        movq      %rbx, 64(%rsp)                                #41.12[spill]
..LN7:
        movq      %r15, 32(%rsp)                                #41.12[spill]
..LN8:

	.long	-2139090926
	.long	-1065320320
	.long	-2105507200
	.long	-913315712
	.word	39078
	.byte	2
	.section .note.GNU-stack, ""
	.file   5 "/usr/include/stdlib.h"
	.file   6 "/usr/include/stdio.h"
	.file   7 "/usr/include/bits/libio.h"
	.file   8 "/home/ingambe/intel/compilers_and_libraries_2018.3.222/linux/compiler/include/stddef.h"
	.global A#
	.global B#
	.global C#
// -- Begin DWARF2 SEGMENT .debug_info
	.section .debug_info
.debug_info_seg:
	.align 1
	.4byte 0x000006ec
	.2byte 0x0004
	.4byte .debug_abbrev_seg
	.byte 0x08
//	DW_TAG_compile_unit:
	.byte 0x01
//	DW_AT_comp_dir:
	.4byte .debug_str
//	DW_AT_name:
	.4byte .debug_str+0x25
//	DW_AT_producer:
	.4byte .debug_str+0x3a
	.4byte .debug_str+0xa8
//	DW_AT_language:
	.byte 0x04
//	DW_AT_use_UTF8:
	.byte 0x01
//	DW_AT_low_pc:
	.8byte 0x0000000000000000
//	DW_AT_ranges:
	.4byte .debug_ranges_seg+0x40
	.byte 0x01
//	DW_AT_stmt_list:
	.4byte .debug_line_seg
//	DW_TAG_namespace:
	.byte 0x02
//	DW_AT_name:
	.4byte 0x00647473
//	DW_TAG_namespace:
	.byte 0x03
//	DW_AT_decl_line:
	.byte 0xfd
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_name:
	.4byte .debug_str+0xc9
//	DW_TAG_imported_module:
	.byte 0x04
//	DW_AT_import:
	.4byte 0x00000034
//	DW_TAG_imported_declaration:
	.byte 0x05
//	DW_AT_import:
	.4byte 0x000002b3
//	DW_TAG_imported_declaration:
	.byte 0x05
//	DW_AT_import:
	.4byte 0x000002df
//	DW_TAG_imported_declaration:
	.byte 0x05
//	DW_AT_import:
	.4byte 0x0000030b
//	DW_TAG_imported_declaration:
	.byte 0x05
//	DW_AT_import:
	.4byte 0x00000328
//	DW_TAG_imported_declaration:
	.byte 0x05
//	DW_AT_import:
	.4byte 0x0000033a
//	DW_TAG_imported_declaration:
	.byte 0x05
//	DW_AT_import:
	.4byte 0x0000034e
//	DW_TAG_imported_declaration:
	.byte 0x05
//	DW_AT_import:
	.4byte 0x00000385
//	DW_TAG_imported_declaration:
	.byte 0x05
//	DW_AT_import:
	.4byte 0x000003a6
//	DW_TAG_imported_declaration:
	.byte 0x05
//	DW_AT_import:
	.4byte 0x000003e6
	.byte 0x00
//	DW_TAG_namespace:
	.byte 0x06
//	DW_AT_name:
	.4byte .debug_str+0xd1
//	DW_TAG_namespace:
	.byte 0x07
//	DW_AT_decl_line:
	.2byte 0x0101
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_name:
	.4byte .debug_str+0xc9
//	DW_TAG_imported_module:
	.byte 0x04
//	DW_AT_import:
	.4byte 0x00000073
//	DW_TAG_imported_declaration:
	.byte 0x05
//	DW_AT_import:
	.4byte 0x000003a6
//	DW_TAG_imported_declaration:
	.byte 0x05
//	DW_AT_import:
	.4byte 0x000003e6
	.byte 0x00
//	DW_TAG_namespace:
	.byte 0x08
//	DW_AT_name:
	.4byte .debug_str+0xdb
//	DW_TAG_base_type:
	.byte 0x09
//	DW_AT_byte_size:
	.byte 0x04
//	DW_AT_encoding:
	.byte 0x05
//	DW_AT_name:
	.4byte 0x00746e69
//	DW_TAG_subprogram:
	.byte 0x0a
//	DW_AT_decl_line:
	.byte 0x29
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_type:
	.4byte 0x00000090
//	DW_AT_name:
	.4byte .debug_str+0xe6
	.4byte .debug_str+0xe6
//	DW_AT_frame_base:
	.2byte 0x7702
	.byte 0x00
//	DW_AT_low_pc:
	.8byte ..L3
//	DW_AT_high_pc:
	.8byte ..LNmain.1306-..L3
	.byte 0x01
//	DW_AT_external:
	.byte 0x01
//	DW_TAG_variable:
	.byte 0x0b
//	DW_AT_decl_line:
	.byte 0x2a
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0xff
//	DW_AT_type:
	.4byte 0x00000167
//	DW_AT_location:
	.2byte 0x9102
	.byte 0x00
//	DW_TAG_variable:
	.byte 0x0b
//	DW_AT_decl_line:
	.byte 0x2a
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x13d
//	DW_AT_type:
	.4byte 0x00000167
//	DW_AT_location:
	.2byte 0x9102
	.byte 0x10
//	DW_TAG_variable:
	.byte 0x0c
//	DW_AT_decl_line:
	.byte 0x2b
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x142
//	DW_AT_type:
	.4byte 0x00000160
//	DW_TAG_lexical_block:
	.byte 0x0d
//	DW_AT_decl_line:
	.byte 0x2d
//	DW_AT_decl_file:
	.byte 0x01
//	DW_TAG_variable:
	.byte 0x0e
//	DW_AT_decl_line:
	.byte 0x2d
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.2byte 0x0069
//	DW_AT_type:
	.4byte 0x00000090
//	DW_TAG_lexical_block:
	.byte 0x0d
//	DW_AT_decl_line:
	.byte 0x2e
//	DW_AT_decl_file:
	.byte 0x01
//	DW_TAG_variable:
	.byte 0x0e
//	DW_AT_decl_line:
	.byte 0x2e
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.2byte 0x006a
//	DW_AT_type:
	.4byte 0x00000090
	.byte 0x00
	.byte 0x00
//	DW_TAG_inlined_subroutine:
	.byte 0x0f
//	DW_AT_low_pc:
	.8byte ..LN79
//	DW_AT_high_pc:
	.8byte ..LN139-..LN79
//	DW_AT_abstract_origin:
	.4byte 0x000001a9
//	DW_AT_call_line:
	.byte 0x35
//	DW_AT_call_column:
	.byte 0x05
//	DW_AT_call_file:
	.byte 0x01
//	DW_TAG_subprogram:
	.byte 0x10
//	DW_AT_decl_line:
	.byte 0x12
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_artificial:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x179
//	DW_AT_ranges:
	.4byte .debug_ranges_seg
//	DW_AT_entry_pc:
	.8byte ..LN0
//	DW_TAG_variable:
	.byte 0x0e
//	DW_AT_decl_line:
	.byte 0x13
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.2byte 0x0069
//	DW_AT_type:
	.4byte 0x00000090
//	DW_TAG_variable:
	.byte 0x11
//	DW_AT_decl_line:
	.byte 0x14
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.2byte 0x006b
//	DW_AT_type:
	.4byte 0x00000090
//	DW_AT_location:
	.2byte 0x5001
//	DW_TAG_variable:
	.byte 0x0e
//	DW_AT_decl_line:
	.byte 0x15
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.2byte 0x006a
//	DW_AT_type:
	.4byte 0x00000090
//	DW_TAG_variable:
	.byte 0x0e
//	DW_AT_decl_line:
	.byte 0x18
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.2byte 0x006a
//	DW_AT_type:
	.4byte 0x00000090
//	DW_TAG_variable:
	.byte 0x0e
//	DW_AT_decl_line:
	.byte 0x1b
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.2byte 0x006a
//	DW_AT_type:
	.4byte 0x00000090
	.byte 0x00
	.byte 0x00
//	DW_TAG_base_type:
	.byte 0x12
//	DW_AT_byte_size:
	.byte 0x04
//	DW_AT_encoding:
	.byte 0x07
//	DW_AT_name:
	.4byte .debug_str+0xeb
//	DW_TAG_base_type:
	.byte 0x12
//	DW_AT_byte_size:
	.byte 0x08
//	DW_AT_encoding:
	.byte 0x04
//	DW_AT_name:
	.4byte .debug_str+0xf8
//	DW_TAG_structure_type:
	.byte 0x13
//	DW_AT_decl_line:
	.byte 0x08
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_byte_size:
	.byte 0x10
//	DW_AT_name:
	.4byte .debug_str+0x105
//	DW_TAG_member:
	.byte 0x14
//	DW_AT_decl_line:
	.byte 0x0a
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte .debug_str+0x10e
//	DW_AT_type:
	.4byte 0x0000018c
//	DW_TAG_member:
	.byte 0x14
//	DW_AT_decl_line:
	.byte 0x0b
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x08
//	DW_AT_name:
	.4byte .debug_str+0x123
//	DW_AT_type:
	.4byte 0x0000019e
	.byte 0x00
//	DW_TAG_typedef:
	.byte 0x15
//	DW_AT_decl_line:
	.byte 0x94
//	DW_AT_decl_file:
	.byte 0x04
//	DW_AT_name:
	.4byte .debug_str+0x115
//	DW_AT_type:
	.4byte 0x00000197
//	DW_TAG_base_type:
	.byte 0x12
//	DW_AT_byte_size:
	.byte 0x08
//	DW_AT_encoding:
	.byte 0x05
//	DW_AT_name:
	.4byte .debug_str+0x11e
//	DW_TAG_typedef:
	.byte 0x15
//	DW_AT_decl_line:
	.byte 0xb8
//	DW_AT_decl_file:
	.byte 0x04
//	DW_AT_name:
	.4byte .debug_str+0x12b
//	DW_AT_type:
	.4byte 0x00000197
//	DW_TAG_subprogram:
	.byte 0x16
//	DW_AT_decl_line:
	.byte 0x11
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_declaration:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x148
	.4byte .debug_str+0x15e
//	DW_AT_external:
	.byte 0x01
//	DW_AT_inline:
	.byte 0x01
//	DW_TAG_subprogram:
	.byte 0x17
//	DW_AT_decl_line:
	.byte 0x11
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_abstract_origin:
	.4byte 0x000001a9
//	DW_AT_low_pc:
	.8byte ..L343
//	DW_AT_high_pc:
	.8byte ..LN_Z21multiplicationMatricev.2479-..L343
//	DW_TAG_lexical_block:
	.byte 0x0d
//	DW_AT_decl_line:
	.byte 0x13
//	DW_AT_decl_file:
	.byte 0x01
//	DW_TAG_variable:
	.byte 0x0e
//	DW_AT_decl_line:
	.byte 0x13
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.2byte 0x0069
//	DW_AT_type:
	.4byte 0x00000090
//	DW_TAG_lexical_block:
	.byte 0x0d
//	DW_AT_decl_line:
	.byte 0x14
//	DW_AT_decl_file:
	.byte 0x01
//	DW_TAG_variable:
	.byte 0x0e
//	DW_AT_decl_line:
	.byte 0x14
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.2byte 0x006b
//	DW_AT_type:
	.4byte 0x00000090
//	DW_TAG_lexical_block:
	.byte 0x0d
//	DW_AT_decl_line:
	.byte 0x15
//	DW_AT_decl_file:
	.byte 0x01
//	DW_TAG_variable:
	.byte 0x0e
//	DW_AT_decl_line:
	.byte 0x15
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.2byte 0x006a
//	DW_AT_type:
	.4byte 0x00000090
	.byte 0x00
//	DW_TAG_lexical_block:
	.byte 0x0d
//	DW_AT_decl_line:
	.byte 0x18
//	DW_AT_decl_file:
	.byte 0x01
//	DW_TAG_variable:
	.byte 0x0e
//	DW_AT_decl_line:
	.byte 0x18
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.2byte 0x006a
//	DW_AT_type:
	.4byte 0x00000090
	.byte 0x00
//	DW_TAG_lexical_block:
	.byte 0x0d
//	DW_AT_decl_line:
	.byte 0x1b
//	DW_AT_decl_file:
	.byte 0x01
//	DW_TAG_variable:
	.byte 0x0e
//	DW_AT_decl_line:
	.byte 0x1b
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.2byte 0x006a
//	DW_AT_type:
	.4byte 0x00000090
	.byte 0x00
	.byte 0x00
	.byte 0x00
//	DW_TAG_lexical_block:
	.byte 0x18
//	DW_AT_decl_line:
	.byte 0x20
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_low_pc:
	.8byte ..LN1348
//	DW_AT_high_pc:
	.8byte ..LN1376
//	DW_TAG_variable:
	.byte 0x0e
//	DW_AT_decl_line:
	.byte 0x20
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.2byte 0x0069
//	DW_AT_type:
	.4byte 0x00000090
//	DW_TAG_lexical_block:
	.byte 0x18
//	DW_AT_decl_line:
	.byte 0x21
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_low_pc:
	.8byte ..LN1348
//	DW_AT_high_pc:
	.8byte ..LN1376
//	DW_TAG_variable:
	.byte 0x11
//	DW_AT_decl_line:
	.byte 0x21
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.2byte 0x006b
//	DW_AT_type:
	.4byte 0x00000090
//	DW_AT_location:
	.2byte 0x5801
//	DW_TAG_lexical_block:
	.byte 0x18
//	DW_AT_decl_line:
	.byte 0x22
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_low_pc:
	.8byte ..LN1349
//	DW_AT_high_pc:
	.8byte ..LN1371
//	DW_TAG_variable:
	.byte 0x11
//	DW_AT_decl_line:
	.byte 0x22
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.2byte 0x006a
//	DW_AT_type:
	.4byte 0x00000090
//	DW_AT_location:
	.2byte 0x5201
	.byte 0x00
	.byte 0x00
	.byte 0x00
//	DW_TAG_subprogram:
	.byte 0x19
//	DW_AT_decl_line:
	.byte 0x12
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_artificial:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x192
//	DW_AT_low_pc:
	.8byte ..LN1386
//	DW_AT_high_pc:
	.8byte ..LN_Z21multiplicationMatricev.2479-..LN1386
//	DW_TAG_variable:
	.byte 0x0e
//	DW_AT_decl_line:
	.byte 0x13
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.2byte 0x0069
//	DW_AT_type:
	.4byte 0x00000090
//	DW_TAG_variable:
	.byte 0x11
//	DW_AT_decl_line:
	.byte 0x14
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.2byte 0x006b
//	DW_AT_type:
	.4byte 0x00000090
//	DW_AT_location:
	.2byte 0x5001
//	DW_TAG_variable:
	.byte 0x0e
//	DW_AT_decl_line:
	.byte 0x15
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.2byte 0x006a
//	DW_AT_type:
	.4byte 0x00000090
//	DW_TAG_variable:
	.byte 0x0e
//	DW_AT_decl_line:
	.byte 0x18
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.2byte 0x006a
//	DW_AT_type:
	.4byte 0x00000090
//	DW_TAG_variable:
	.byte 0x0e
//	DW_AT_decl_line:
	.byte 0x1b
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.2byte 0x006a
//	DW_AT_type:
	.4byte 0x00000090
	.byte 0x00
	.byte 0x00
//	DW_TAG_typedef:
	.byte 0x15
//	DW_AT_decl_line:
	.byte 0x3e
//	DW_AT_decl_file:
	.byte 0x05
//	DW_AT_name:
	.4byte .debug_str+0x1c1
//	DW_AT_type:
	.4byte 0x000002be
//	DW_TAG_structure_type:
	.byte 0x1a
//	DW_AT_decl_line:
	.byte 0x3b
//	DW_AT_decl_file:
	.byte 0x05
//	DW_AT_byte_size:
	.byte 0x08
//	DW_TAG_member:
	.byte 0x14
//	DW_AT_decl_line:
	.byte 0x3c
//	DW_AT_decl_file:
	.byte 0x05
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte .debug_str+0x1c7
//	DW_AT_type:
	.4byte 0x00000090
//	DW_TAG_member:
	.byte 0x1b
//	DW_AT_decl_line:
	.byte 0x3d
//	DW_AT_decl_file:
	.byte 0x05
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x04
//	DW_AT_name:
	.4byte 0x006d6572
//	DW_AT_type:
	.4byte 0x00000090
	.byte 0x00
//	DW_TAG_typedef:
	.byte 0x15
//	DW_AT_decl_line:
	.byte 0x46
//	DW_AT_decl_file:
	.byte 0x05
//	DW_AT_name:
	.4byte .debug_str+0x1cc
//	DW_AT_type:
	.4byte 0x000002ea
//	DW_TAG_structure_type:
	.byte 0x1a
//	DW_AT_decl_line:
	.byte 0x43
//	DW_AT_decl_file:
	.byte 0x05
//	DW_AT_byte_size:
	.byte 0x10
//	DW_TAG_member:
	.byte 0x14
//	DW_AT_decl_line:
	.byte 0x44
//	DW_AT_decl_file:
	.byte 0x05
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte .debug_str+0x1c7
//	DW_AT_type:
	.4byte 0x00000197
//	DW_TAG_member:
	.byte 0x1b
//	DW_AT_decl_line:
	.byte 0x45
//	DW_AT_decl_file:
	.byte 0x05
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x08
//	DW_AT_name:
	.4byte 0x006d6572
//	DW_AT_type:
	.4byte 0x00000197
	.byte 0x00
//	DW_TAG_subprogram:
	.byte 0x1c
//	DW_AT_decl_line:
	.2byte 0x0353
//	DW_AT_decl_file:
	.byte 0x05
//	DW_AT_declaration:
	.byte 0x01
//	DW_AT_type:
	.4byte 0x000002df
//	DW_AT_name:
	.4byte .debug_str+0x1d3
	.4byte .debug_str+0x1d3
//	DW_AT_external:
	.byte 0x01
//	DW_TAG_formal_parameter:
	.byte 0x1d
//	DW_AT_type:
	.4byte 0x00000197
//	DW_TAG_formal_parameter:
	.byte 0x1d
//	DW_AT_type:
	.4byte 0x00000197
	.byte 0x00
//	DW_TAG_subprogram:
	.byte 0x1e
//	DW_AT_decl_line:
	.2byte 0x01c5
//	DW_AT_decl_file:
	.byte 0x05
//	DW_AT_declaration:
	.byte 0x01
//	DW_AT_type:
	.4byte 0x00000090
//	DW_AT_name:
	.4byte .debug_str+0x1d8
	.4byte .debug_str+0x1d8
//	DW_AT_external:
	.byte 0x01
//	DW_TAG_subprogram:
	.byte 0x1f
//	DW_AT_decl_line:
	.2byte 0x01c7
//	DW_AT_decl_file:
	.byte 0x05
//	DW_AT_declaration:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x1dd
	.4byte .debug_str+0x1dd
//	DW_AT_external:
	.byte 0x01
//	DW_TAG_formal_parameter:
	.byte 0x1d
//	DW_AT_type:
	.4byte 0x00000159
	.byte 0x00
//	DW_TAG_subprogram:
	.byte 0x20
//	DW_AT_decl_line:
	.byte 0x75
//	DW_AT_decl_file:
	.byte 0x05
//	DW_AT_declaration:
	.byte 0x01
//	DW_AT_type:
	.4byte 0x00000160
//	DW_AT_name:
	.4byte .debug_str+0x1e3
	.4byte .debug_str+0x1e3
//	DW_AT_external:
	.byte 0x01
//	DW_TAG_formal_parameter:
	.byte 0x1d
//	DW_AT_type:
	.4byte 0x0000036a
//	DW_TAG_formal_parameter:
	.byte 0x1d
//	DW_AT_type:
	.4byte 0x0000037b
	.byte 0x00
//	DW_TAG_pointer_type:
	.byte 0x21
//	DW_AT_type:
	.4byte 0x0000036f
//	DW_TAG_const_type:
	.byte 0x22
//	DW_AT_type:
	.4byte 0x00000374
//	DW_TAG_base_type:
	.byte 0x12
//	DW_AT_byte_size:
	.byte 0x01
//	DW_AT_encoding:
	.byte 0x06
//	DW_AT_name:
	.4byte .debug_str+0x1ea
//	DW_TAG_pointer_type:
	.byte 0x21
//	DW_AT_type:
	.4byte 0x00000380
//	DW_TAG_pointer_type:
	.byte 0x21
//	DW_AT_type:
	.4byte 0x00000374
//	DW_TAG_subprogram:
	.byte 0x20
//	DW_AT_decl_line:
	.byte 0xb0
//	DW_AT_decl_file:
	.byte 0x05
//	DW_AT_declaration:
	.byte 0x01
//	DW_AT_type:
	.4byte 0x00000197
//	DW_AT_name:
	.4byte .debug_str+0x1ef
	.4byte .debug_str+0x1ef
//	DW_AT_external:
	.byte 0x01
//	DW_TAG_formal_parameter:
	.byte 0x1d
//	DW_AT_type:
	.4byte 0x0000036a
//	DW_TAG_formal_parameter:
	.byte 0x1d
//	DW_AT_type:
	.4byte 0x0000037b
//	DW_TAG_formal_parameter:
	.byte 0x1d
//	DW_AT_type:
	.4byte 0x00000090
	.byte 0x00
//	DW_TAG_typedef:
	.byte 0x15
//	DW_AT_decl_line:
	.byte 0x50
//	DW_AT_decl_file:
	.byte 0x05
//	DW_AT_name:
	.4byte .debug_str+0x1f6
//	DW_AT_type:
	.4byte 0x000003b1
//	DW_TAG_structure_type:
	.byte 0x1a
//	DW_AT_decl_line:
	.byte 0x4d
//	DW_AT_decl_file:
	.byte 0x05
//	DW_AT_byte_size:
	.byte 0x10
//	DW_TAG_member:
	.byte 0x14
//	DW_AT_decl_line:
	.byte 0x4e
//	DW_AT_decl_file:
	.byte 0x05
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte .debug_str+0x1c7
//	DW_AT_type:
	.4byte 0x000003d2
//	DW_TAG_member:
	.byte 0x1b
//	DW_AT_decl_line:
	.byte 0x4f
//	DW_AT_decl_file:
	.byte 0x05
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x08
//	DW_AT_name:
	.4byte 0x006d6572
//	DW_AT_type:
	.4byte 0x000003d2
	.byte 0x00
//	DW_TAG_base_type:
	.byte 0x12
//	DW_AT_byte_size:
	.byte 0x08
//	DW_AT_encoding:
	.byte 0x05
//	DW_AT_name:
	.4byte .debug_str+0x1fe
//	DW_TAG_variable:
	.byte 0x23
//	DW_AT_decl_line:
	.byte 0x89
//	DW_AT_decl_file:
	.byte 0x06
//	DW_AT_name:
	.4byte .debug_str+0x210
//	DW_AT_type:
	.4byte 0x00000407
//	DW_AT_declaration:
	.byte 0x01
//	DW_AT_external:
	.byte 0x01
//	DW_TAG_subprogram:
	.byte 0x20
//	DW_AT_decl_line:
	.byte 0xc8
//	DW_AT_decl_file:
	.byte 0x05
//	DW_AT_declaration:
	.byte 0x01
//	DW_AT_type:
	.4byte 0x000003d2
//	DW_AT_name:
	.4byte .debug_str+0x208
	.4byte .debug_str+0x208
//	DW_AT_external:
	.byte 0x01
//	DW_TAG_formal_parameter:
	.byte 0x1d
//	DW_AT_type:
	.4byte 0x0000036a
//	DW_TAG_formal_parameter:
	.byte 0x1d
//	DW_AT_type:
	.4byte 0x0000037b
//	DW_TAG_formal_parameter:
	.byte 0x1d
//	DW_AT_type:
	.4byte 0x00000090
	.byte 0x00
//	DW_TAG_pointer_type:
	.byte 0x21
//	DW_AT_type:
	.4byte 0x0000040c
//	DW_TAG_structure_type:
	.byte 0x13
//	DW_AT_decl_line:
	.byte 0xf5
//	DW_AT_decl_file:
	.byte 0x07
//	DW_AT_byte_size:
	.byte 0xd8
//	DW_AT_name:
	.4byte .debug_str+0x217
//	DW_TAG_member:
	.byte 0x14
//	DW_AT_decl_line:
	.byte 0xf6
//	DW_AT_decl_file:
	.byte 0x07
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte .debug_str+0x220
//	DW_AT_type:
	.4byte 0x00000090
//	DW_TAG_member:
	.byte 0x14
//	DW_AT_decl_line:
	.byte 0xfb
//	DW_AT_decl_file:
	.byte 0x07
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x08
//	DW_AT_name:
	.4byte .debug_str+0x227
//	DW_AT_type:
	.4byte 0x00000380
//	DW_TAG_member:
	.byte 0x14
//	DW_AT_decl_line:
	.byte 0xfc
//	DW_AT_decl_file:
	.byte 0x07
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x10
//	DW_AT_name:
	.4byte .debug_str+0x234
//	DW_AT_type:
	.4byte 0x00000380
//	DW_TAG_member:
	.byte 0x14
//	DW_AT_decl_line:
	.byte 0xfd
//	DW_AT_decl_file:
	.byte 0x07
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x18
//	DW_AT_name:
	.4byte .debug_str+0x241
//	DW_AT_type:
	.4byte 0x00000380
//	DW_TAG_member:
	.byte 0x14
//	DW_AT_decl_line:
	.byte 0xfe
//	DW_AT_decl_file:
	.byte 0x07
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x20
//	DW_AT_name:
	.4byte .debug_str+0x24f
//	DW_AT_type:
	.4byte 0x00000380
//	DW_TAG_member:
	.byte 0x14
//	DW_AT_decl_line:
	.byte 0xff
//	DW_AT_decl_file:
	.byte 0x07
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x28
//	DW_AT_name:
	.4byte .debug_str+0x25e
//	DW_AT_type:
	.4byte 0x00000380
//	DW_TAG_member:
	.byte 0x24
//	DW_AT_decl_line:
	.2byte 0x0100
//	DW_AT_decl_file:
	.byte 0x07
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x30
//	DW_AT_name:
	.4byte .debug_str+0x26c
//	DW_AT_type:
	.4byte 0x00000380
//	DW_TAG_member:
	.byte 0x24
//	DW_AT_decl_line:
	.2byte 0x0101
//	DW_AT_decl_file:
	.byte 0x07
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x38
//	DW_AT_name:
	.4byte .debug_str+0x27a
//	DW_AT_type:
	.4byte 0x00000380
//	DW_TAG_member:
	.byte 0x24
//	DW_AT_decl_line:
	.2byte 0x0102
//	DW_AT_decl_file:
	.byte 0x07
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x40
//	DW_AT_name:
	.4byte .debug_str+0x287
//	DW_AT_type:
	.4byte 0x00000380
//	DW_TAG_member:
	.byte 0x24
//	DW_AT_decl_line:
	.2byte 0x0104
//	DW_AT_decl_file:
	.byte 0x07
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x48
//	DW_AT_name:
	.4byte .debug_str+0x293
//	DW_AT_type:
	.4byte 0x00000380
//	DW_TAG_member:
	.byte 0x24
//	DW_AT_decl_line:
	.2byte 0x0105
//	DW_AT_decl_file:
	.byte 0x07
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x50
//	DW_AT_name:
	.4byte .debug_str+0x2a1
//	DW_AT_type:
	.4byte 0x00000380
//	DW_TAG_member:
	.byte 0x24
//	DW_AT_decl_line:
	.2byte 0x0106
//	DW_AT_decl_file:
	.byte 0x07
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x58
//	DW_AT_name:
	.4byte .debug_str+0x2b1
//	DW_AT_type:
	.4byte 0x00000380
//	DW_TAG_member:
	.byte 0x24
//	DW_AT_decl_line:
	.2byte 0x0108
//	DW_AT_decl_file:
	.byte 0x07
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x60
//	DW_AT_name:
	.4byte .debug_str+0x2be
//	DW_AT_type:
	.4byte 0x000005ce
//	DW_TAG_member:
	.byte 0x24
//	DW_AT_decl_line:
	.2byte 0x010a
//	DW_AT_decl_file:
	.byte 0x07
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x68
//	DW_AT_name:
	.4byte .debug_str+0x2e3
//	DW_AT_type:
	.4byte 0x00000407
//	DW_TAG_member:
	.byte 0x24
//	DW_AT_decl_line:
	.2byte 0x010c
//	DW_AT_decl_file:
	.byte 0x07
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x70
//	DW_AT_name:
	.4byte .debug_str+0x2ea
//	DW_AT_type:
	.4byte 0x00000090
//	DW_TAG_member:
	.byte 0x24
//	DW_AT_decl_line:
	.2byte 0x0110
//	DW_AT_decl_file:
	.byte 0x07
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x74
//	DW_AT_name:
	.4byte .debug_str+0x2f2
//	DW_AT_type:
	.4byte 0x00000090
//	DW_TAG_member:
	.byte 0x24
//	DW_AT_decl_line:
	.2byte 0x0112
//	DW_AT_decl_file:
	.byte 0x07
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x78
//	DW_AT_name:
	.4byte .debug_str+0x2fa
//	DW_AT_type:
	.4byte 0x00000606
//	DW_TAG_member:
	.byte 0x24
//	DW_AT_decl_line:
	.2byte 0x0116
//	DW_AT_decl_file:
	.byte 0x07
//	DW_AT_data_member_location:
	.4byte 0x01802303
//	DW_AT_name:
	.4byte .debug_str+0x30e
//	DW_AT_type:
	.4byte 0x00000611
//	DW_TAG_member:
	.byte 0x24
//	DW_AT_decl_line:
	.2byte 0x0117
//	DW_AT_decl_file:
	.byte 0x07
//	DW_AT_data_member_location:
	.4byte 0x01822303
//	DW_AT_name:
	.4byte .debug_str+0x329
//	DW_AT_type:
	.4byte 0x00000374
//	DW_TAG_member:
	.byte 0x24
//	DW_AT_decl_line:
	.2byte 0x0118
//	DW_AT_decl_file:
	.byte 0x07
//	DW_AT_data_member_location:
	.4byte 0x01832303
//	DW_AT_name:
	.4byte .debug_str+0x338
//	DW_AT_type:
	.4byte 0x00000618
//	DW_TAG_member:
	.byte 0x24
//	DW_AT_decl_line:
	.2byte 0x011c
//	DW_AT_decl_file:
	.byte 0x07
//	DW_AT_data_member_location:
	.4byte 0x01882303
//	DW_AT_name:
	.4byte .debug_str+0x342
//	DW_AT_type:
	.4byte 0x00000621
//	DW_TAG_member:
	.byte 0x24
//	DW_AT_decl_line:
	.2byte 0x0125
//	DW_AT_decl_file:
	.byte 0x07
//	DW_AT_data_member_location:
	.4byte 0x01902303
//	DW_AT_name:
	.4byte .debug_str+0x2fe
//	DW_AT_type:
	.4byte 0x00000638
//	DW_TAG_member:
	.byte 0x24
//	DW_AT_decl_line:
	.2byte 0x012d
//	DW_AT_decl_file:
	.byte 0x07
//	DW_AT_data_member_location:
	.4byte 0x01982303
//	DW_AT_name:
	.4byte .debug_str+0x362
//	DW_AT_type:
	.4byte 0x00000643
//	DW_TAG_member:
	.byte 0x24
//	DW_AT_decl_line:
	.2byte 0x012e
//	DW_AT_decl_file:
	.byte 0x07
//	DW_AT_data_member_location:
	.4byte 0x01a02303
//	DW_AT_name:
	.4byte .debug_str+0x369
//	DW_AT_type:
	.4byte 0x00000643
//	DW_TAG_member:
	.byte 0x24
//	DW_AT_decl_line:
	.2byte 0x012f
//	DW_AT_decl_file:
	.byte 0x07
//	DW_AT_data_member_location:
	.4byte 0x01a82303
//	DW_AT_name:
	.4byte .debug_str+0x370
//	DW_AT_type:
	.4byte 0x00000643
//	DW_TAG_member:
	.byte 0x24
//	DW_AT_decl_line:
	.2byte 0x0130
//	DW_AT_decl_file:
	.byte 0x07
//	DW_AT_data_member_location:
	.4byte 0x01b02303
//	DW_AT_name:
	.4byte .debug_str+0x377
//	DW_AT_type:
	.4byte 0x00000643
//	DW_TAG_member:
	.byte 0x24
//	DW_AT_decl_line:
	.2byte 0x0132
//	DW_AT_decl_file:
	.byte 0x07
//	DW_AT_data_member_location:
	.4byte 0x01b82303
//	DW_AT_name:
	.4byte .debug_str+0x37e
//	DW_AT_type:
	.4byte 0x00000648
//	DW_TAG_member:
	.byte 0x24
//	DW_AT_decl_line:
	.2byte 0x0133
//	DW_AT_decl_file:
	.byte 0x07
//	DW_AT_data_member_location:
	.4byte 0x01c02303
//	DW_AT_name:
	.4byte .debug_str+0x39a
//	DW_AT_type:
	.4byte 0x00000090
//	DW_TAG_member:
	.byte 0x24
//	DW_AT_decl_line:
	.2byte 0x0135
//	DW_AT_decl_file:
	.byte 0x07
//	DW_AT_data_member_location:
	.4byte 0x01c42303
//	DW_AT_name:
	.4byte .debug_str+0x3a0
//	DW_AT_type:
	.4byte 0x0000065a
	.byte 0x00
//	DW_TAG_pointer_type:
	.byte 0x21
//	DW_AT_type:
	.4byte 0x000005d3
//	DW_TAG_structure_type:
	.byte 0x13
//	DW_AT_decl_line:
	.byte 0xa0
//	DW_AT_decl_file:
	.byte 0x07
//	DW_AT_byte_size:
	.byte 0x18
//	DW_AT_name:
	.4byte .debug_str+0x2c7
//	DW_TAG_member:
	.byte 0x14
//	DW_AT_decl_line:
	.byte 0xa1
//	DW_AT_decl_file:
	.byte 0x07
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte .debug_str+0x2d2
//	DW_AT_type:
	.4byte 0x000005ce
//	DW_TAG_member:
	.byte 0x14
//	DW_AT_decl_line:
	.byte 0xa2
//	DW_AT_decl_file:
	.byte 0x07
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x08
//	DW_AT_name:
	.4byte .debug_str+0x2d8
//	DW_AT_type:
	.4byte 0x00000407
//	DW_TAG_member:
	.byte 0x14
//	DW_AT_decl_line:
	.byte 0xa6
//	DW_AT_decl_file:
	.byte 0x07
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x10
//	DW_AT_name:
	.4byte .debug_str+0x2de
//	DW_AT_type:
	.4byte 0x00000090
	.byte 0x00
//	DW_TAG_typedef:
	.byte 0x15
//	DW_AT_decl_line:
	.byte 0x8c
//	DW_AT_decl_file:
	.byte 0x04
//	DW_AT_name:
	.4byte .debug_str+0x306
//	DW_AT_type:
	.4byte 0x00000197
//	DW_TAG_base_type:
	.byte 0x12
//	DW_AT_byte_size:
	.byte 0x02
//	DW_AT_encoding:
	.byte 0x07
//	DW_AT_name:
	.4byte .debug_str+0x31a
//	DW_TAG_array_type:
	.byte 0x25
//	DW_AT_type:
	.4byte 0x00000374
//	DW_AT_byte_size:
	.byte 0x01
//	DW_TAG_subrange_type:
	.byte 0x26
//	DW_AT_upper_bound:
	.byte 0x00
	.byte 0x00
//	DW_TAG_pointer_type:
	.byte 0x21
//	DW_AT_type:
	.4byte 0x00000626
//	DW_TAG_typedef:
	.byte 0x15
//	DW_AT_decl_line:
	.byte 0x9a
//	DW_AT_decl_file:
	.byte 0x07
//	DW_AT_name:
	.4byte .debug_str+0x348
//	DW_AT_type:
	.4byte 0x00000631
//	DW_TAG_base_type:
	.byte 0x12
//	DW_AT_byte_size:
	.byte 0x00
//	DW_AT_encoding:
	.byte 0x05
//	DW_AT_name:
	.4byte .debug_str+0x353
//	DW_TAG_typedef:
	.byte 0x15
//	DW_AT_decl_line:
	.byte 0x8d
//	DW_AT_decl_file:
	.byte 0x04
//	DW_AT_name:
	.4byte .debug_str+0x358
//	DW_AT_type:
	.4byte 0x00000197
//	DW_TAG_pointer_type:
	.byte 0x21
//	DW_AT_type:
	.4byte 0x00000631
//	DW_TAG_typedef:
	.byte 0x15
//	DW_AT_decl_line:
	.byte 0x2f
//	DW_AT_decl_file:
	.byte 0x08
//	DW_AT_name:
	.4byte .debug_str+0x385
//	DW_AT_type:
	.4byte 0x00000653
//	DW_TAG_base_type:
	.byte 0x12
//	DW_AT_byte_size:
	.byte 0x08
//	DW_AT_encoding:
	.byte 0x07
//	DW_AT_name:
	.4byte .debug_str+0x38c
//	DW_TAG_array_type:
	.byte 0x25
//	DW_AT_type:
	.4byte 0x00000374
//	DW_AT_byte_size:
	.byte 0x14
//	DW_TAG_subrange_type:
	.byte 0x26
//	DW_AT_upper_bound:
	.byte 0x13
	.byte 0x00
//	DW_TAG_variable:
	.byte 0x27
//	DW_AT_decl_line:
	.byte 0x0d
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.2byte 0x0041
//	DW_AT_type:
	.4byte 0x00000677
//	DW_AT_location:
	.2byte 0x0309
	.8byte A
//	DW_AT_external:
	.byte 0x01
//	DW_TAG_array_type:
	.byte 0x28
//	DW_AT_type:
	.4byte 0x00000687
//	DW_AT_byte_size:
	.4byte 0x04000000
//	DW_TAG_subrange_type:
	.byte 0x29
//	DW_AT_upper_bound:
	.2byte 0x0fff
//	DW_TAG_subrange_type:
	.byte 0x29
//	DW_AT_upper_bound:
	.2byte 0x0fff
	.byte 0x00
//	DW_TAG_base_type:
	.byte 0x12
//	DW_AT_byte_size:
	.byte 0x04
//	DW_AT_encoding:
	.byte 0x04
//	DW_AT_name:
	.4byte .debug_str+0x3a9
//	DW_TAG_variable:
	.byte 0x27
//	DW_AT_decl_line:
	.byte 0x0e
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.2byte 0x0042
//	DW_AT_type:
	.4byte 0x000006a2
//	DW_AT_location:
	.2byte 0x0309
	.8byte B
//	DW_AT_external:
	.byte 0x01
//	DW_TAG_array_type:
	.byte 0x28
//	DW_AT_type:
	.4byte 0x00000687
//	DW_AT_byte_size:
	.4byte 0x04000000
//	DW_TAG_subrange_type:
	.byte 0x29
//	DW_AT_upper_bound:
	.2byte 0x0fff
//	DW_TAG_subrange_type:
	.byte 0x29
//	DW_AT_upper_bound:
	.2byte 0x0fff
	.byte 0x00
//	DW_TAG_variable:
	.byte 0x27
//	DW_AT_decl_line:
	.byte 0x0f
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.2byte 0x0043
//	DW_AT_type:
	.4byte 0x000006c6
//	DW_AT_location:
	.2byte 0x0309
	.8byte C
//	DW_AT_external:
	.byte 0x01
//	DW_TAG_array_type:
	.byte 0x28
//	DW_AT_type:
	.4byte 0x00000687
//	DW_AT_byte_size:
	.4byte 0x04000000
//	DW_TAG_subrange_type:
	.byte 0x29
//	DW_AT_upper_bound:
	.2byte 0x0fff
//	DW_TAG_subrange_type:
	.byte 0x29
//	DW_AT_upper_bound:
	.2byte 0x0fff
	.byte 0x00
//	DW_TAG_imported_declaration:
	.byte 0x05
//	DW_AT_import:
	.4byte 0x0000030b
//	DW_TAG_imported_declaration:
	.byte 0x05
//	DW_AT_import:
	.4byte 0x00000328
//	DW_TAG_imported_declaration:
	.byte 0x05
//	DW_AT_import:
	.4byte 0x0000033a
//	DW_TAG_imported_declaration:
	.byte 0x05
//	DW_AT_import:
	.4byte 0x0000034e
//	DW_TAG_imported_declaration:
	.byte 0x05
//	DW_AT_import:
	.4byte 0x00000385
	.byte 0x00
// -- Begin DWARF2 SEGMENT .debug_line
	.section .debug_line
.debug_line_seg:
	.align 1
// -- Begin DWARF2 SEGMENT .debug_abbrev
	.section .debug_abbrev
.debug_abbrev_seg:
	.align 1
	.byte 0x01
	.byte 0x11
